package com.zhenia.practicekolos.task1;

public class task1 {
    /*Задание 1
1. Класс больница - номер больницы, адрес, количество отделов, список людей, которые там лежат
2. Класс пациент, в нем имя, фамилия, медицинская карта, возраст, место работы, должность
3. Медицинская карта - Больница, которой она принадлежит, индентификационный номер

Предусмотреть методы - добавление и выписка чела из больницы, соответственно при добавлении - ему создается медицинская карта, при выписке - удаляется
Сортировка медицинских карт по номеру
Людей по имени и фамилии (и то и то)
Продемонстрировать работу методов, обязательно добавить проверку челов, которые лежат в больнице, чтобы у них создавались мед карты, а у челов, которых выписали, их уже не было


*/
}
