package com.zhenia.practicekolos.task2;

public class task2 {
    /*Задание 2
У тебя в файле есть список продуктов
Название Категория Цена
Огурец       Овощи       35
Добавь чтобы было несколько категорий, и в каждой категории по 2 - 3 товара

В первом результирующем файле -
Категория Средняя цена

Во втором результирующем файле -
Продукты отсортированы по возрастанию цены
То есть
Название Цена

Для этого у тебя должен быть отдельный класс - продукт, и при чтении файла преобразуешь к этому классу, и добавляешь в коллекцию
Далее с помощью метода сортируешь и выписываешь в новый файл*/
}
